import React from 'react';

import './Article.css'

import houseRepairing from '../../Images/house-repairing.jpg';
import buildingRepairing from '../../Images/building-repairing.jpg';
import officeRepairing from '../../Images/office-repairing.jpg';
import shopRepairing from '../../Images/shop-repairing.png';
import houseBuild from '../../Images/house-build2.png';
import cottegeBuild from '../../Images/cottege-build2.jpg';

function Article() {

    const pages = [
        {href: "/repairing/house", name: "Ремонт квартири", img: houseRepairing,
            text: "Придбання житла в новобудові – задоволення не з дешевих, тому 85-90% людей купують квартири на вторинному ринку. Після придбання квартири, в якій вже хтось проживав, практично всі нові власники намагаються зробити ремонт свого нового житла ще до переїзду. Деякі це роблять своїми силами, проте далеко не у всіх є час і можливість займатися ремонтом самостійно. У такій ситуації на допомогу приходять компанії, що спеціалізуються на ремонті квартир і інших приміщень. Ціни на ремонт квартир залежать від складності ремонту, вартості використовуваних будівельних матеріалів, кількості залучених фахівців та інших факторів.\n" +
                "Перш ніж приступити до виконання будь-яких робіт по внутрішньому облаштуванню житла в першу чергу необхідно визначити, який вид ремонту вам необхідний. Це може бути:\n" +
                "- капітальний;\n" +
                "- косметичний;\n" +
                "- євроремонт;\n" +
                "- ремонт, що включає повне перепланування приміщення.\n" +
                "В ході виконання косметичного ремонту не вносяться зміни у «зовнішній вигляд» квартири. Як правило, всі дії зводяться до фарбування стель, поклейка шпалер, заміну існуючого лінолеуму або килимового покриття. Таке впорядкування квартири не зажадає від нових господарів великих вкладень.\n" +
                "Якщо запланований капітальний ремонт квартири, який є більш складним у порівнянні з «косметикою», господарі нової квартири зіткнутися з низкою суттєвих змін. Вони торкнуться не тільки будівельних і малярських робіт, але і внутрішньобудинкових комунікаційних систем – сантехніки, каналізаційного обладнання, електропроводки тощо. Якщо ж ремонт передбачає перепланування квартири, кардинальна зміна зовнішнього вигляду приміщення, об’єднання кімнат, то в цьому випадку повинен бути складений проектний план і обов’язково узгоджений в спеціальних організаціях.\n" +
                "Проведення євроремонту має на увазі впровадження в будівельні роботи ряд новаторських рішень, що спираються на сучасні ресурси і технології. В кінцевому підсумку приміщення стає більш комфортним, стильним і сучасним. Ці зміни стосуються оформлення кімнат і удосконалення системи освітлення, кондиціонування та опалення.\n" +
                "Одним з популярних видів ремонту квартир, ціна на який залежить від багатьох чинників, є оформлення приміщення «під ключ». В цьому випадку ремонтні роботи замовляються «повним комплектом», починаючи з обробки стін і стель, і закінчуючи налагодженням всіх внутрішніх комунікацій і вивезенням будівельного сміття.\n" +
                "Займатися ремонтом купленого житла самостійно або залучити до проведення робіт фахівців? Таке питання хвилює більшість нових власників житла, придбаного на вторинному ринку. Найпростіше, звичайно ж, звернутися за допомогою до досвідчених фахівців по ряду причин:\n" +
                "- фахівці профільної компанії зможуть забезпечити комплексний підхід до вирішення будівельних і ремонтних завдань;\n" +
                "- можна бути впевненим в тому, що якість ремонту буде на висоті;\n" +
                "- робота обійдеться не дешево, але в будь-якому випадку це буде коштувати вам менше, ніж самостійні експерименти і багаторазові «переробки».\n" +
                "Якщо ви ніколи не стикалися з ремонтними роботами, простіше і безпечніше делегувати цю роботу тим людям, які виконують її регулярно і знають, як її робити правильно, швидко і якісно.\n" +
                "Чому варто звернутися до фахівців нашої компанії? На те є кілька об’єктивних причин! Ми гарантуємо чесність і порядність, надаємо звіт по витраченим коштам і матеріалами, забезпечуємо індивідуальний підхід до кожного клієнта, використовуємо у своїй роботі тільки сучасні матеріали і технології, даємо гарантію на кожен вид виконуваних робіт."},
        {href: "/repairing/building", name: "Ремонт будинку", img: buildingRepairing,
            text: "Рано чи пізно кожному власнику приватного будинку доводиться стикатися з необхідністю його ремонту. При цьому абсолютно не важливо, яким буде цей ремонт: капітальним чи косметичним, проводити його потрібно якісно, акуратно і з обов’язковим дотриманням усіх технологій. Зробити його можна самостійно і заощадити гроші на оплаті послуг будівельників, але витративши при цьому сили, час і нерви. А якщо у вас немає необхідних навичок, то результат такого ремонту далеко не завжди може виправдовувати очікування, і гроші на матеріали можуть виявитися витраченими даремно. Якщо ви хочете, щоб ваше житло було комфортним і затишним, а також безпечним і функціональним, його ремонт все ж краще всього довірити професіоналам.\n" +
                "Який же ремонт може знадобитися вашому будинку? Це буде залежати від «ступеня зношеності» попереднього ремонту, ваших бажань, цілей і можливостей. Наприклад, якщо ви просто хочете освіжити внутрішнє оздоблення кімнат, то буде досить провести косметичний ремонт будинку. Він включає в себе демонтаж старих покриттів і всілякі оздоблювальні роботи, що стосуються оновлення зовнішнього вигляду стін, підлоги і стелі. Даний вид будівельних робіт не передбачає проведення будь-яких інженерно-монтажних заходів і перепланування приміщення.\n" +
                "Капітальний ремонт має на увазі проведення повного спектра ремонтних та оздоблювальних робіт. Він в себе включає:\n" +
                "- демонтаж старих і установку нових конструктивних елементів;\n" +
                "- перепланування приміщень;\n" +
                "- заміну різних інженерних систем, в тому числі сантехніки і електропроводки;\n" +
                "- вирівнювання стін, стелі та підлоги;\n" +
                "- оздоблювальні роботи і установку вікон, дверей, міжкімнатних перегородок.\n" +
                "Також капітальний ремонт будинку під ключ може включати такі роботи як посилення існуючого фундаменту будівлі і балок, заміна перекриттів, утеплення фасаду, зовнішні оздоблювальні роботи. Крім цього при замовленні будівельних робіт під ключ будівельних компаній надають такі додаткові послуги як консультація дизайнера і проектувальника, підбір та закупівля всіх необхідних матеріалів, нагляд за ходом виконанням робіт, повне документальний супровід.\n" +
                "Часто ремонтні роботи – це досить тривалий і непростий період в житті кожного домовласника, який вимагає від нього сил і засобів. Однак сьогодні повністю змінити свій будинок можна швидко, без зайвої суєти і при цьому навіть заощадити кошти. Все що вам для цього потрібно – залучити до ремонту свого будинку бригаду кваліфікованих майстрів надійної будівельної компанії.\n" +
                "Переваги очевидні:\n" +
                "- у вас як у замовника на руках буде узгоджений план ремонту будинку. Його наявність дасть гарантії того, що роботи будуть виконані саме в тому вигляді, який зазначений в плані і договорі;\n" +
                "- наявність плану і договору буде гарантією того, що роботи будуть відповідати вашим вимогам і побажанням, будуть використані обумовлені технології і оздоблювальні матеріали;\n" +
                "- в договорі буде позначена гранична дата завершення ремонтних робіт, що дасть вам можливість планувати переїзд, покупку нових меблів та інші заходи, які повинні відбутися після завершення робіт;\n" +
                "- при укладанні договору з будівельною компанією, ви будете точно знати, яку суму вам необхідно буде оплатити виконані ремонтні роботи, що дозволить виключити незаплановані витрати.\n" +
                "Приємним бонусом при укладенні договору на ремонт будинку під ключ є те, що вивіз будівельного сміття стає турботою підрядника. Вам же залишиться тільки прийняти готовий об’єкт і переїхати в відремонтоване приміщення."},
        {href: "/repairing/office", name: "Ремонт офісу", img: officeRepairing,
            text: "Офіс – це візитна картка компанії або підприємства, тому на ремонті цього приміщення економити не варто, так само, як і ставитися до нього без належної відповідальності. Ті, хто вже стикався з необхідністю оформлення офісного приміщення, знають, що в цій справі немає місця поспіху, кожна деталь повинна бути продумана до дрібниць. Офіс має як би «говорити» про відповідальність, успішність і процвітання компанії або підприємства, викликати довіру потенційних клієнтів або компаньйонів і створювати правильний і вигідний імідж, налаштовувати на плідну співпрацю.\n" +
                "Нову людину завжди зустрічають по одягу, а нову, ще не відому компанію – по обробці офісу і атмосфері, яка там панує. Погодьтеся, компанія, яка навчає людей працювати і заробляти свої перші мільйони в найкоротші терміни, не може розташовуватися в приміщенні зі столітнім ремонтом і меблями радянського зразка! Тому така послуга як якісний і кваліфікований ремонт офісів завжди затребувана.\n" +
                "Компанія, зацікавлена в швидкому розвитку і правильному позиціонуванні себе на ринку, зобов’язана подбати про облаштування представницького офісу з сучасною обробкою і меблями. Ремонт офісів в Києві може бути різним, розрахованим на різний бюджет, тип і призначення приміщення. Це може бути стандартна поклейка нових шпалер, заміна підлогового покриття, покупка лаконічних і практичних меблів або ж капітальний ремонт офісів під ключ з індивідуальним замовленням меблів ручної роботи та ексклюзивних матеріалів для оздоблення стін.\n" +
                "Головні цілі проведення ремонту:\n" +
                "- створення сприятливого враження у партнерів;\n" +
                "- залучення потенційних клієнтів або інвесторів;\n" +
                "- підвищення сервісу послуг, що надаються.\n" +
                "Також не варто забувати про те, що обсяги робіт і прибуток підприємства створює його колектив. Тому для підвищення ефективності роботи колективу необхідно створити для нього максимально комфортні умови роботи і хорошу атмосферу всередині колективу.\n" +
                "Найчастіше компанії замовляють в Києві ремонт офісів під ключ. Для того щоб він був якісним, необхідно довіряти його проведення команді професіоналів, яка здатна забезпечити індивідуальний підхід до виконання кожного етапу виконуваних робіт. Ремонт може бути косметичним, капітальним або елітним. Перш ніж приступати до будь-якого з вище перерахованих видів робіт слід обов’язково врахувати ряд важливих моментів:\n" +
                "- Кількість працівників компанії, які будуть працювати в офісі;\n" +
                "- Розміщення працівників офісу на квадратному метрі площі;\n" +
                "- Місце розташування всіх елементів меблів і оргтехніки.\n" +
                "У порівнянні з оформленням квартир, оформлення та благоустрій офісу є менш трудомістким, так як в більшості випадків виключає ряд дій, наприклад, таких як установка сантехніки.\n" +
                "Будь-який ремонт проводиться в кілька етапів:\n" +
                "- Розробка дизайну приміщення.\n" +
                "- Далі виконується демонтаж старих конструкцій, винесення сміття і старих меблів.\n" +
                "- Потім проводиться розкладка всіх комунікаційних систем і електропроводки.\n" +
                "- Після цього проводиться «чорнова» обробка стель і стін, оформлення підлогового покриття, після цього «чистове» оздоблення.\n" +
                "- На завершальному етапі виконується остаточне оформлення офісного приміщення – поклейка шпалер, установка систем кондиціонування, монтаж систем освітлення, завезення нових меблів і т.д.\n" +
                "Перш ніж довірити ремонт свого приміщення компанії оціните співвідношення якості робіт і ціни, вивчіть приклади вже виконаних ремонтів, дізнайтеся, як відгукуються про компанію клієнти, які вже скористалися її послугами. Пам’ятайте, навіть самий звичайний і здається простим косметичний ремонт – це не просто комплекс робіт по оновленню зовнішнього вигляду приміщення. Це «інструмент» для створення вашої візитної картки. Від того, наскільки продуманий і як саме влаштований ваш офіс буде залежати, чи викличе він довіру у відвідувачів і клієнтів або навпаки відштовхне їх. Дозвольте обслуговувати свій офіс професіоналам з компанії «БудКомпані»!\n"},
        {href: "/repairing/shop", name: "Ремонт магазину", img: shopRepairing,
            text: "Запорука успіху будь-якого магазину – грамотне планування торгової площі і якісний, продуманий до дрібниць ремонт, який виконаний відповідно до новітніх європейських стандартів. Обстановка в магазині повинна сприяти створенню комфортної атмосфери для відвідувачів і сприятливого середовища для здійснення покупок, а отже і збільшення обсягів проданої продукції і прибутку. Головне завдання власника магазину полягає у визначенні загального напрямку оформлення приміщення магазину і його майбутнього інтер’єру, а ось безпосереднє виконання ремонтних робіт і обробку торгових приміщень краще довірити досвідченим фахівцям, які допоможуть втілити в життя всі ідеї і задумки.\n" +
                "Кожен господар магазину повинен пам’ятати про те, що його торгове приміщення повинно бути зручним як для покупців, так і для працівників. Тому правильна організація простору в торгових площах і якісний ремонт європейського рівня дуже важлива складова успіху. Навіть якщо торгова площа невелика, потрібно створити всі необхідні умови для максимально ефективної роботи персоналу та комфортного переміщення покупців.\n" +
                "Ремонт приміщення під магазин включає в себе цілий комплекс робіт, а саме:\n" +
                "- первинний огляд об’єкта і складання дизайнерського проекту;\n" +
                "- складання кошторису і підбір оздоблювальних матеріалів;\n" +
                "- розробка перепланування приміщення;\n" +
                "- безпосередньо поетапне виконання ремонтно-оздоблювальних робіт;\n" +
                "- здача готового об’єкта в обумовлені з замовником терміни.\n" +
                "Ремонт магазину повинен відповідати напрямку продукції, яка в ньому реалізується. Саме під асортимент товару рекомендується підбирати освітлювальні прилади, тип і форму прилавків і стелажів, колір стін і стель.\n" +
                "Ремонт магазинів може бути косметичним або капітальним під ключ. Косметичний ремонт являє собою швидке оновлення інтер’єру з мінімальним втручанням в існуючі інженерні системи.\n" +
                "Косметичних ремонт може включати в себе наступні види робіт:\n" +
                "- видалення старого оздоблювального матеріалу;\n" +
                "- установку внутрішніх перегородок;\n" +
                "- електромонтажні роботи без заміни електропроводки;\n" +
                "- сантехнічні і плиткові роботи;\n" +
                "- вирівнювання поверхні стін і стелі, в тому числі з використанням гіпсокартону;\n" +
                "- заміну дверей і підлогового покриття.\n" +
                "Косметичний ремонт магазину здатний в найкоротші терміни надати стильний і оригінальний вид торговому приміщенню і залучити покупців.\n" +
                "Капітальний ремонт магазину під ключ включає в себе наступні етапи:\n" +
                "- демонтаж старих оздоблювальних матеріалів, електричної проводки і систем комунікації;\n" +
                "- усунення перегородок, якщо такі є, з метою розширення торговельних приміщень, зведення нових перегородок в разі потреби;\n" +
                "- перепланування системи електропостачання, монтаж електричних точок будь-якої складності;\n" +
                "- перепланування і установка систем опалення і водопостачання;\n" +
                "- установка сантехнічного обладнання;\n" +
                "- стартова і фінішна шпаклівка стін;\n" +
                "- монтаж гіпсокартонних стель, облицювання стін плиткою, укладання підлогового покриття;\n" +
                "- декорування стін і стель, установка дверей.\n" +
                "Особливу увагу варто приділити матеріалу підлогового покриття. Воно повинно мати бездоганний вигляд і при цьому бути міцним і зносостійким, що витримує великі навантаження, стійким до стирання, особливо на тих ділянках підлоги, де очікується велика прохідність відвідувачів.\n" +
                "Вибирайте якісні матеріали та довіряйте ремонт свого магазину професіоналам з компанії «БудКомпані», і він буде радувати вас довгі роки і приведе безліч нових покупців, які стануть постійними гостями вашої торгової точки.\n"},
        {href: "/construction/house", name: "Будівництво будинків", img: houseBuild,
            text: "Будівництво будинків під ключ сьогодні можна назвати найбільш правильним рішенням для сучасної ділової людини, що живе в умовах вічної зайнятості. Весь головний біль, клопоти і відповідальність за хід ремонтних і оздоблювальних робіт можна перекласти на надійну будівельну компанію. Найголовніше – чітко обумовити всі умови і нюанси будівництва та документально зафіксувати їх в договорі. Будівництво нового будинку під ключ в розумінні нашої компанії – це повне ведення всіх процесів, що включають вибір земельної ділянки (у разі потреби), проектування, безпосередньо будівництво і виконання внутрішніх опоряджувальних робіт, введення об’єкта в експлуатацію і здачу замовнику.\n" +
                "Наша компанія має успішний досвід в сфері капітального будівництва та ремонту будинків і котеджів під ключ. Ми максимально відкриті до діалогу з потенційними замовниками і клієнтами, з радістю надамо всю необхідну інформацію щодо майбутніх робіт, покажемо наші поточні і готові об’єкти.\n" +
                "До кожного клієнта і об’єкту будівництва ми здійснюємо індивідуальний підхід. Ми однаково добре вміємо будувати будинки і котеджі економ класу і втілювати в життя найбільш незвичайні і сміливі дорогі архітектурні шедеври. Запропоновані нами рішення допоможуть вам витрачати ваш бюджет економно і раціонально, а також дозволять зберегти час і нерви.\n" +
                "За роки свого існування наша компанія заслужила прекрасну репутацію на ринку ремонту і будівництва. Ми надаємо своїм клієнтам повний спектр послуг, в який входить професійне проектування майбутнього будинку, тобто створення індивідуального макету, забезпечення повного комплексу будівельних і внутрішніх опоряджувальних робіт по благоустрою прибудинкових територій.\n" +
                "Вибираючи нашу будівельну компанію, ви можете бути впевнені в тому, що будівництво вашого будинку буде здійснюватися в суворій відповідності до затвердженого і узгодженим з вами планом.\n" +
                "Ціна будинку під ключ, пропонована нашою компанією, безпосередньо залежить від таких параметрів як:\n" +
                "- повна площа об’єкта;\n" +
                "- стан місцевості, на якій планується будівництво;\n" +
                "- стан і наявність різних міжповерхових конструкцій (перекриттів);\n" +
                "- наявність підвального приміщення в майбутньому при будуванні;\n" +
                "- необхідність зведення цокольного поверху;\n" +
                "- різновид застосовуваних будівельних та оздоблювальних матеріалів, їх кількість;\n" +
                "- складність архітектурних, будівельних та оздоблювальних робіт.\n" +
                "Ми надаємо гарантію якості на всі роботи, виконані фахівцями нашої компанії, а також забезпечуємо обслуговування побудованих нами об’єктів, застосовуємо першосортні будівельні, оздоблювальні та облицювальні матеріали. Наша компанія співпрацює з перевіреними постачальниками матеріалів і фурнітури, які гарантують високу якість своєї продукції.\n" +
                "Крім всіх перерахованих вище переваг, варто відзначити, що будівництво будинків і котеджів в Києві під ключ ми здійснюємо в чітко встановлені терміни, що вигідно виділяє нас на фоні численних конкурентів."},
        {href: "/construction/cottege", name: "Будівництво котеджів", img: cottegeBuild,
            text: "Будівництво будинків і котеджів – одна з галузей сучасного будівництва, яка найбільш активно розвивається. Сьогодні бажання втекти від метушні і шуму великого міста охоплює все більше число жителів мегаполісів. Зрештою, вони замислюються про покупку або будівництво будинку за містом. Тому будівництво заміських будинків стає все популярнішим. Ви вже замислювалися над питанням, у скільки обходиться будівництво будинків, які ціни на зведення котеджу і його внутрішнє оздоблення? Якщо так, значить настав час звернутися до фахівців нашої компанії.\n" +
                "Кожен будинок – це відображення його господарів, прояв їх індивідуальності, звичок, бажань і набутого життєвого досвіду. Щоб побудований будинок приносив тільки радість і став воістину улюбленим місцем всіх членів сім’ї потрібно зробити його максимально комфортним, функціональним і затишним. Фахівці нашої компанії готові уважно вислухати всі побажання замовника, поділитися своїм досвідом, дати ділову пораду і прийти на допомогу в ході прийняття рішень, що стосуються будівництва будинку.\n" +
                "Досвідчені архітектори нашої компанії запропонують вам на вибір велику кількість варіантів будівель котеджів, садиб і заміських будинків на будь-який смак і бюджет. Хочете замовити послугу котедж під ключ за індивідуально розробленим проектом? Наша компанія готова запропонувати кожному замовникам комплексний підхід, що включає:\n" +
                "- архітектурне рішення;\n" +
                "- інженерне проектування всіх комунікацій;\n" +
                "- дизайн інтер’єру і підбір меблів;\n" +
                "- будівництво котеджів «під ключ».\n" +
                "Стаючи нашим клієнтом, ви можете не стримувати політ своєї фантазії – використовувані нами сучасні технології дозволять нам створювати абсолютно унікальні будови, які оснащені за останнім словом техніки. Вартість будівництва котеджу під ключ залежить від обсягу та складності робіт, розміру котеджу, використовуваних матеріалів та інших факторів, кожен з яких неодмінно обмовляється і прописується в договорі.\n" +
                "Особливо цікаві проекти, замовники яких хочуть, щоб при будівництві котеджу використовувалися тільки найсучасніші технології і матеріали. Давно мрієте жити саме в такому своєму будинку? Ми готові втілити ваші мрії в реальність! Ось чому варто вибрати нас:\n" +
                "- ми надаємо весь комплекс послуг – починаючи з проектування майбутнього будинку і закінчуючи здачею готового об’єкта з внутрішньою обробкою і всіма комунікаціями;\n" +
                "- всі використовувані матеріали є сучасними, якісними і безпечними;\n" +
                "- ми оформляємо всі дозвільні документи, укладаємо договір і консультуємо при розрахунку кількості необхідних матеріалів;\n" +
                "- наші досвідчені співробітники, володіють цінними навичками, вивчили і впевнено використовують передові технології в сферах будівництва та дизайну.\n" +
                "Всі роботи виконуються якісно і в обумовлені в договорі терміни, починаючи з архітектурного проектування і затвердження плану робіт і закінчуючи прибиранням і вивезенням будівельного сміття. Ми використовуємо універсальний підхід до виконання будь-яких завдань, тому за кожним напрямом робіт закріплені висококваліфіковані фахівці, які досконало знають свою сферу діяльності і виконують свою частину роботи якісно і відповідально.\n"}
    ]

    let page = "";

    for(let i = 0; i < pages.length; i++) {
        if(pages[i].href == window.location.pathname) {
            page = i;
            break;
        }
    }

    const paragraph = pages[page].text.split("\n").map( (line) => {
        return (
            <p>
                {line}
            </p>
        );
    })

    const linkTree = window.location.pathname.split("/");

    let returnLink = "";

    for(let i = 1; i < (linkTree.length-1); i++)
    {
        returnLink += "/" + linkTree[i];
    }

    return (
        <div className="article">
            <div className="article-content">
                <img src={pages[page].img}/>
                <div className="article-title">
                    <h2>{pages[page].name}</h2>
                </div>
                <div className="article-text">
                    {paragraph}
                </div>
                <div className="article-links-panel">
                    <a href={returnLink}>Переглянути інші варіанти</a>
                    <a href="/contact-us">Перейти до замовлення</a>
                </div>
            </div>
        </div>
    );
}

export default Article;