import React from 'react';

import './BrandHistory.css'

import treeImage from '../../../Images/tree.png';

function BrandHistory() {
    return (
        <div className="brand-history">
            <div className="container-two">
                <img src={treeImage} />
            </div>
            <div className="history">
                <h2>Трохи історії...</h2>
                <p>«БудКомпані» створена у 2007 році.
                Компанія пропонує повний комплекс послуг в будівельній сфері, як для комерційної нерухомості, так і для житлової.
                Ми пишаємося кожним реалізованим проектом адже робимо якісно, швидко та відповідно до стандартів та вимог замовника.
                Завдяки багаторічному досвіду та партнерським стосункам з постачальниками матеріалів,
                компанія пропонує ціни зі знижками, що допомагає оптимізувати витрати.</p>
                <p>Кожен «будинок», будь це квартира в багатоповерхівці, заміський котедж або будинок в приватному секторі,
                – це відображення його господарів, їх звичок, придбаного з роками досвіду,
                улюблене місце відпочинку і відновлення сил і енергії. Якщо ви хочете, щоб ваш будинок був саме таким,
                при його будівництві або ремонті потрібно дуже відповідально підійти до вибору будівельної компанії,
                    досвідчені фахівці якої завжди прийдуть на допомогу в процесі прийняття всіх рішень, що стосуються ремонту і будівництва.</p>
            </div>
        </div>
    );
}

export default BrandHistory;