import React from "react";

import './Policy.css'

function Policy() {
    return (
        <div className="policy">
            <h1>Політика конфіденційності</h1>
            <h2>Умови використання сайту</h2>
            <p>Прочитайте ці умови, і якщо ви не згодні з ними, не використовуйте цей сайт.</p>
            <p>Вся інформація на сайті є інтелектуальною власністю автора і захищена Законом України «Про авторське право і суміжні права». Використання будь-яких матеріалів з сайту можливо виключно з дозволу автора та з додаванням посилання на першоджерело.</p>
            <h2>Збір інформації</h2>
            <p>Персональна інформація, така як ім’я, контактний номер телефону, адреса електронної пошти та інше, яка збирається на цьому сайті, добровільно надається користувачами. Така інформація необхідна для взаємодії керівництва компанії БудКомпані з користувачем веб-сайту, надаючи консультації та всі необхідні (запитувані) дані. Дана персональна інформація використовується лише для задоволення потреб чи побажань користувача цього веб-сайту. Використання зібраної персональної інформації в інших цілях можливе у разі додаткового погодження зі сторони користувача, або у випадках, що передбачені чинним законодавством України.</p>
            <p>Також, коли ви відвідуєте наш сайт, використовуються різні технології для збирання та зберігання інформації, результатом роботи яких, може бути збереження запису одного або декількох кукі (англ. cookie) чи анонімних ідентифікаторів.</p>
            <h2>Відмова від відповідальності</h2>
            <p>Ремонтно-будівельна компанія БудКомпані в будь-який час без повідомлення може вносити зміни в контент, що опублікований на цьому сайті (опис послуг, ціни, інформаційні матеріали, фото та інше). Відповідальність за будь-які збитки, що виникли внаслідок використання, неможливості використання або результатів використання цього сайту, компанія БудКомпані за жодних обставин не несе (включно з, але не обмежуючись збитком від втрати прибутку, даних або від переривання ділової активності).</p>
            <h2>Зворотний зв’язок та відгуки</h2>
            <p>Направляючи нам запит, користувач несе відповідальність за зміст свого повідомлення, яке не має:</p>
            <ul>
                <li>порушувати Законодавство України;</li>
                <li>бути – загрозливим, шкідливим, наклепницьким;</li>
                <li>суперечити морально-етичним нормам;</li>
                <li>пропагувати ненависть і/або дискримінацію людей за расовою, етнічною, статевою, релігійною або соціальною ознаками;</li>
                <li>порушувати авторські права;</li>
                <li>містити образи на адресу конкретних осіб або організацій.</li>
            </ul>
        </div>
    );
}

export default Policy;